Revit 2026 API

# WireSizeSet Constructor

---

Initializes a new instance of the WireSizeSet class

**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public WireSizeSet()
```
```vb
Public Sub New
```
```cpp
public:
WireSizeSet()
```
```fsharp
new : unit -> WireSizeSet
```

#### Reference

WireSizeSet Class

Autodesk.Revit.DB.Electrical Namespace